---
title: IntersectionResultArray
classe: Autodesk.Revit.DB.IntersectionResultArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# IntersectionResultArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `intersectionResultArray.IsEmpty` | Boolean |
| `IntersectionResult Item { get; set; }` | `intersectionResultArray.Item` | IntersectionResult |
| `Int32 Size { get; }` | `intersectionResultArray.Size` | Int32 |
| `Void Append(IntersectionResult)` | `intersectionResultArray.Append(item)` | Void |
| `Void Clear()` | `intersectionResultArray.Clear()` | Void |
| `IntersectionResultArrayIterator ForwardIterator()` | `intersectionResultArray.ForwardIterator()` | IntersectionResultArrayIterator |
| `IEnumerator GetEnumerator()` | `intersectionResultArray.GetEnumerator()` | IEnumerator |
| `Void Insert(IntersectionResult, Int32)` | `intersectionResultArray.Insert(item, index)` | Void |
| `IntersectionResultArrayIterator ReverseIterator()` | `intersectionResultArray.ReverseIterator()` | IntersectionResultArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```